experiments/science-kimi-official.yaml
# New provider/new run. Do not resume the old intermediary-provider campaign.
version: science-campaign-v1
name: kimi-code-moonshot-k3-output-20x-001

harness:
  # Real Node @moonshot-ai/kimi-code 0.28.1; not the separate Python Kimi CLI.
  name: kimi-code
  backend: custom-api             # Direct official HTTP API, not ChatGPT subscription.
  reasoning_effort: null           # Fixed Chat bridge omits effort; official K3 defaults to max.
  public_decision_log: false

model:
  name: kimi-k3                    # Official model ID; do not rewrite as relay alias Kimi-K3.

tasks: [s-205, s-203, s-202, s-204]
instruction_profile: geometry-only-free-mesh-output-v1
budget:
  model_calls: 64
  native_seconds: 1800
  per_run_seconds: 1800
  request_seconds: 600
documentation: openfoam-v2306-reference-v1

authentication:
  env_file: .env.kimi-official      # Host only; official Moonshot credentials, no relay fallback.

execution:
  python: ../.venv-harbor/bin/python
  prepared_parent: runs/prepared
  output_parent: runs/manual
  provider_concurrency: 1
  native_concurrency: 1

# Fresh evidence required; never reuse the intermediary-provider probe.
evidence:
  interface_check: live-probe
  probe: audits/kimi-official-20260916-001/client-probe
  junit:
    - audits/kimi-official-20260916-001/tests-release.xml

release:
  ready: true                      # Source-bound tests + official client probe checked before launch.
  audit_report: docs/KIMI_OFFICIAL_SETUP_20260916.md
  blockers: []